# 1.Import module

In [188]:
import pandas as pd

# 2.Loading data

In [189]:
df = pd.read_csv('../datasets/cust_info.csv')
df.head()
df.info()
print(len(df))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18494 entries, 0 to 18493
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18490 non-null  float64
 1   cst_key             18494 non-null  object
 2   cst_firstname       18486 non-null  object
 3   cst_lastname        18487 non-null  object
 4   cst_marital_status  18487 non-null  object
 5   cst_gndr            13916 non-null  object
 6   cst_create_date     18490 non-null  object
dtypes: float64(1), object(6)
memory usage: 1011.5+ KB
18494

# Checking data

In [190]:
# Check for nulls
df.isnull().sum()
df[df['cst_id'].isnull()]

,cst_id,cst_key,cst_firstname,cst_lastname,cst_marital_status,cst_gndr,cst_create_date
18446,NaN,SF566,NaN,NaN,NaN,NaN,NaN
18482,NaN,PO25,NaN,NaN,NaN,NaN,NaN
18492,NaN,13451235,NaN,NaN,NaN,NaN,NaN
18493,NaN,A01Ass,NaN,NaN,NaN,NaN,NaN

In [191]:
# Check for duplicate cst_id values
df_checkDuplicate = df[df['cst_id'].duplicated(keep=False)]
print(df_checkDuplicate)

        cst_id     cst_key cst_firstname cst_lastname cst_marital_status  \
18433  29433.0  AW00029433           NaN          NaN                  M
18434  29433.0  AW00029433        Thomas         King                  M
18446      NaN       SF566           NaN          NaN                NaN
18451  29449.0  AW00029449           NaN         Chen                  S
18452  29449.0  AW00029449         Laura         Chen                  S
18469  29466.0  AW00029466           NaN          NaN                NaN
18470  29466.0  AW00029466         Lance      Jimenez                  M
18471  29466.0  AW00029466         Lance      Jimenez                  M
18478  29473.0  AW00029473        Carmen          NaN                NaN
18479  29473.0  AW00029473        Carmen       Subram                  S
18482      NaN        PO25           NaN          NaN                NaN
18490  29483.0  AW00029483           NaN      Navarro                NaN
18491  29483.0  AW00029483          Marc      Navarro                  M
18492      NaN    13451235           NaN          NaN                NaN
18493      NaN      A01Ass           NaN          NaN                NaN

      cst_gndr cst_create_date
18433        M      2026-01-25
18434        M      2026-01-27
18446      NaN             NaN
18451      NaN      2026-01-25
18452        F      2026-01-26
18469      NaN      2026-01-25
18470      NaN      2026-01-26
18471        M      2026-01-27
18478      NaN      2026-01-25
18479      NaN      2026-01-26
18482      NaN             NaN
18490      NaN      2026-01-25
18491      NaN      2026-01-27
18492      NaN             NaN
18493      NaN             NaN

# Transforming data

In [192]:
# Format data types
df['cst_id'] = df['cst_id'].astype('Int64')
df['cst_create_date'] = pd.to_datetime(df['cst_create_date'], errors='coerce') # 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18494 entries, 0 to 18493
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18490 non-null  Int64
 1   cst_key             18494 non-null  object
 2   cst_firstname       18486 non-null  object
 3   cst_lastname        18487 non-null  object
 4   cst_marital_status  18487 non-null  object
 5   cst_gndr            13916 non-null  object
 6   cst_create_date     18490 non-null  datetime64[ns]
dtypes: Int64(1), datetime64[ns](1), object(5)
memory usage: 1.0+ MB

In [193]:
# Drop nulls
df = df.dropna(subset=['cst_id'])
print(df)

       cst_id     cst_key cst_firstname cst_lastname cst_marital_status  \
0       11000  AW00011000           Jon        Yang                   M
1       11001  AW00011001        Eugene      Huang                    S
2       11002  AW00011002         Ruben       Torres                  M
3       11003  AW00011003       Christy          Zhu                  S
4       11004  AW00011004     Elizabeth      Johnson                  S
...       ...         ...           ...          ...                ...
18487   29480  AW00029480          Nina         Raji                  S
18488   29481  AW00029481          Ivan         Suri                  S
18489   29482  AW00029482       Clayton        Zhang                  M
18490   29483  AW00029483           NaN      Navarro                NaN
18491   29483  AW00029483          Marc      Navarro                  M

      cst_gndr cst_create_date
0            M      2025-10-06
1            M      2025-10-06
2            M      2025-10-06
3            F      2025-10-06
4            F      2025-10-06
...        ...             ...
18487      NaN      2026-01-25
18488      NaN      2026-01-25
18489      NaN      2026-01-25
18490      NaN      2026-01-25
18491      NaN      2026-01-27

[18490 rows x 7 columns]

In [194]:
# Sort value followed by cst_id and cst_create_date, then drop duplicates and keep the last record
df = (
    df.sort_values(['cst_id', 'cst_create_date'])
    .drop_duplicates(subset=['cst_id'], keep='last')
)
print(df.tail(10))

       cst_id     cst_key cst_firstname cst_lastname cst_marital_status  \
18480   29474  AW00029474         Jaime         Raje                  M
18481   29475  AW00029475         Jared         Ward                  S
18483   29476  AW00029476     Elizabeth      Bradley                  M
18484   29477  AW00029477          Neil         Ruiz                  M
18485   29478  AW00029478        Darren      Carlson                  S
18486   29479  AW00029479         Tommy         Tang                  M
18487   29480  AW00029480          Nina         Raji                  S
18488   29481  AW00029481          Ivan         Suri                  S
18489   29482  AW00029482       Clayton        Zhang                  M
18491   29483  AW00029483          Marc      Navarro                  M

      cst_gndr cst_create_date
18480      NaN      2026-01-25
18481      NaN      2026-01-25
18483      NaN      2026-01-25
18484      NaN      2026-01-25
18485      NaN      2026-01-25
18486      NaN      2026-01-25
18487      NaN      2026-01-25
18488      NaN      2026-01-25
18489      NaN      2026-01-25
18491      NaN      2026-01-27

In [195]:
# fill nulls and formatting data
df['cst_gndr'] = df['cst_gndr'].apply(lambda x: 'Female' if x == 'F' else 'Male')
df['cst_marital_status'] = df['cst_marital_status'].apply(lambda x: 'Married' if x == 'M' else 'Single')
print(df.tail(5))
df.info()

       cst_id     cst_key cst_firstname cst_lastname cst_marital_status  \
18486   29479  AW00029479         Tommy         Tang            Married
18487   29480  AW00029480          Nina         Raji             Single
18488   29481  AW00029481          Ivan         Suri             Single
18489   29482  AW00029482       Clayton        Zhang            Married
18491   29483  AW00029483          Marc      Navarro            Married

      cst_gndr cst_create_date
18486     Male      2026-01-25
18487     Male      2026-01-25
18488     Male      2026-01-25
18489     Male      2026-01-25
18491     Male      2026-01-27
<class 'pandas.core.frame.DataFrame'>
Index: 18484 entries, 0 to 18491
Data columns (total 7 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   cst_id              18484 non-null  Int64
 1   cst_key             18484 non-null  object
 2   cst_firstname       18484 non-null  object
 3   cst_lastname        18484 non-null  object
 4   cst_marital_status  18484 non-null  object
 5   cst_gndr            18484 non-null  object
 6   cst_create_date     18484 non-null  datetime64[ns]
dtypes: Int64(1), datetime64[ns](1), object(5)
memory usage: 1.1+ MB